import {Category} from "./entities/Categories.js";
import {Shop} from "./entities/Shop.js";
import {Good} from "./entities/Good.js";

const data = {
    categories: [
        new Category('Джин', 1, [1, 2, 3]),
        new Category('Ром', 2, [4, 5, 6]),
        new Category('Віскі', 3, [7, 8, 9]),
    ],
    goods: [
        new Good('Джин Whitley Neill Quince 0.7 л 43%',
            '819',
            'https://content.rozetka.com.ua/goods/images/big/234379796.png',
            'Whitley Neill — сухий джин ручної роботи виняткової якості. Дистильований невеликими партіями, цей джин є творінням Джонні Ніла, прямого нащадка Томаса Грінолла й останнього в довгій лінійці дистиляторів сім\'ї. Джин об\'єднує досвід 8 поколінь і любов до пригод. Смак до пригод і відкриттів проходить червоною ниткою через усі вісім поколінь сімейного дерева Вітлі Нейлл. Тому не дивно, що на межі століть, коли Фредерік Нейлл подорожував через Персію, він виявив низку екзотичних фруктів, трав і спецій, які надихнули його на поповнення колекції рецептів джинів Гріналла Вітлі. Він був вкрай здивований, виявивши плоди айви, що ростуть у давніх горах. Безпомилковий характерний смак турецької айви, змішаний із п\'янкою сумішшю перських трав і спецій, надають Whitley Neill Quince Gin особливого спокусливого смаку. Джин ручної роботи виняткової якості з ароматом, настільки ж багатим, як і його родовід.',
            1),
        new Good('Джин Tenjaku 0.7 л 37.5%',
            '799',
            'https://content2.rozetka.com.ua/goods/images/big/176741851.jpg',
            'Tenjaku Gin — унікальний напій, що належить до категорії джинів «London Dry». Головною особливістю технології виробництва цього джину є використання міксу європейських і азійських «ботанікалів». Під ретельним контролем майстра дистиляції Чікако Тамічі з Європи добираються: ялівець, коріандр, апельсин, лимон, корінь Ангеліки, кориця, лакриця, ірис, мускатний горіх. А японської основою ароматів слугують Юзу, зелений перець Саншо, листя зеленого чаю й персик із регіону Яманасі.\n' +
            'Такий склад ароматичних компонентів робить джин Tenjaku дуже гармонійним, збалансованим і насиченим напоєм із переважанням ноток юзу, цитрусових, зеленого чаю й персика в ароматі.',
            2),
        new Good('Джин Etsu 0.7 л 43% в коробці',
            '2035',
            'https://content2.rozetka.com.ua/goods/images/big/13742485.jpg',
            'Джин Etsu має свіжий, добре збалансований, перцевий смак із нотками зелених чаїв і ягід. Посмак: Sansho перець наприкінці й аромат yuzu. Аромат квітковий & рослинний, нотки цитрусових фруктів зі стійкістю yuzu. П\'ється в чистому вигляді і/або з льодом для того, щоб дістати свіжість і тривалість у смаку, у коктейлях на свій вибір, з чудовою закускою.',
            3),
        new Good('Ром Bumbu Original до 15 років витримки 0.7 л 40%',
            '1489',
            'https://content2.rozetka.com.ua/goods/images/big/165263800.jpg',
            '«Bumbu» — крафтовий ром 15-річної витримки, створений із цукрової тростини, який був відібраний у 8 країнах Вест-Індії й Карибського басейну: Барбадосі, Белізі, Бразилії, Коста-Ріці, Домініканській Республіці, Сальвадорі, Гайані та Гондурасі. Витримка, створення бленда та розлив «Bumbu» здійснюється на одному з найстаріших підприємств Барбадосу — «The West Indies Rum Distillery», заснованого 1893 року.',
            4),
        new Good('Ром Botafogo Spiced 0.7 л 40%',
            '649',
            'https://content.rozetka.com.ua/goods/images/big/159266041.jpg',
            'Ром Botafogo Spiced має діамантовий і бурштиновий колір. Спробувавши його одного разу, ви ніколи не забудете цей ром. Келих Botafogo — подорож прямо на Карибські острови.\n' +
            '\n' +
            'У смаку спеції, ваніль, карамель і локриця. Посмак: спеції. Аромат солодкий і збалансований, цитрусовий, ванільними нотами, що поступово з\'являються.',
            5),
        new Good('Ром Don Papa 7 років витримки 0.7 л 40%',
            '1777',
            'https://content2.rozetka.com.ua/goods/images/big/165024353.jpg',
            'Бренд Don Papa був заснований виконавчим директором Remy Cointreau Стівеном Керроллом. Своє ім\'я бренд дістав на честь Папи Ісіо, лідера Філіппінської революції 1890-х років, який допоміг витіснити іспанців з острова та здобути незалежність для Шугарландії. Дон Папа був вперше представлений у Баколоді 2012 року, а потім у Манілі того ж року. Відтоді бренд став доступний на міжнародних ринках, як-от Великобританія та Іспанія. Дон Папа почали реалізовувати в Сполучених Штатах із 2017 року. На сьогодні Don Papa Rum є в розпорядженні філіппінської компанії Bleeding Heart Rum.',
            6),
        new Good('Віскі Tenjaku 3 роки витримки 0.7 л 40%',
            '899',
            'https://content1.rozetka.com.ua/goods/images/big/237595212.jpg',
            'Tenjaku — дуже м\'яке віскі, витримане у бочках з-під бурбона та хересу. Мінімальний термін витримки — 3 роки. Варто зазначити, що японське віскі витримується в набагато теплішому кліматі, ніж у Шотландії (витримка супроводжується високою «часткою ангелів», дозрівання віскі проходить інтенсивніше). Все це надає напою дуже делікатний аромат і м\'який насичений смак.',
            7),
        new Good('Віскі Talisker 10 років витримки 0.7 л 45.8%',
            '2327',
            'https://content1.rozetka.com.ua/goods/images/big/247702194.jpg',
            'Винокурня Talisker була побудована братами Мак Аскілами 1830 року, вона є єдиною винокурнею на острові Скай. Кілька разів винокурня Talisker була реконструйована, але до цього дня дотримується своїх традицій, винокурня має оригінальні перегінні куби U-подібної форми, для охолодження застосовуються змійовики, що є рідкістю в Шотландії.\n' +
            '\n' +
            'Для виробництва віскі використовується місцевий солод і вода з джерел пагорба Cnoc-nan-Speireag, завдяки чому напій набуває унікальних властивостей, він вирізняється високим умістом фенолів і солонувато-торф\'яним ароматом.\n' +
            '\n' +
            'Talisker — один із великих віскі з острівним характером. Він також використовується для створення знаменитих блендів.',
            8),
        new Good('Віскі Glenfiddich 8 років витримки Fire and Cane 0.7 л 43%',
            '2471',
            'https://content2.rozetka.com.ua/goods/images/big/18701138.jpg',
            'Компанія William Grant&Sons, заснована 1887 року, є одним із найстаріших сімейних виробництв у світі. З тих далеких часів і до сьогоднішнього дня компанія належить родині Вільяма Гранта й управляється його нащадками вже в п\'ятому поколінні.\n' +
            '\n' +
            'Компанія має великий портфель преміальних алкогольних, брендів відомих у всьому світі, що дає змогу надати покупцеві вибір у всіх основних сегментах віскі і сегменті суперпреміум джина та лікеру. Віскі цього виробника відомі в усьому світі, вони продаються у понад 180 країнах. 2007 року компанія Вільям Грант і сини завоювала статус ""Найкраща винокурня"" на міжнародному конкурсі "" IWSC Worldwide "". Tullamore Dew — один із найпопулярніших у світі ірландських віскі. Історія цього легендарного напою бере свій початок у 1829 році, коли в місті Талмор була побудована винокурня Tullamore. Завод розташувався в найбагатшому сільськогосподарському регіоні графства Оффель, де вирощувався прекрасний ячмінь, і розташовувалися джерела джерельної води. Отже, у виробника були всі інгредієнти для створення першокласного віскі. Tullamore Dew дістав свою назву за ініціалами одного з його творців — Daniel E. Williams: DEW.',
            9),
    ]
};

const shop = new Shop(data);

shop.init();